/****************************************************************************/
/*
 * PCF8593 operations
 * This is free and unencumbered software released into the public domain.
 * LZs,2005
 */
/****************************************************************************/

#include "iotn26.h"
#include <ina90.h>
#include "types.h"

#include "main.h"
#include "time.h"
#include "i2c.h"
#include "display.h"

/*=========================================================================*/

extern	UCHR	e2err;

/*=========================================================================*/

UCHR	hour;
UCHR	min;

/****************************************************************************/

void Err(UCHR n)
{
	cls();
	px(0xe);
	px(n);
	px(e2err);
	delay(3000);
}

/****************************************************************************/
/*
 * Установить время
 */

void Set_Time(void)
{
	wr_clk(0,0x80);
	wr_clk(1,0);
	wr_clk(2,0);
	wr_clk(3,b2bcd(min));
	wr_clk(4,b2bcd(hour));
	wr_clk(0,0);
}

/****************************************************************************/
/*
 * Прочитать время
 */

void Get_Time(void)
{
	wr_clk(0,0x40);
	if(e2err) {
		Err(1);
		return;
	}
	min = bcd2b(rd_clk(3));
	if(e2err) {
		Err(2);
		return;
	}
	hour= bcd2b(rd_clk(4) & 0x3f);
	if(e2err) {
		Err(3);
		return;
	}
	wr_clk(0,0);
	if(e2err) Err(4);
}

/****************************************************************************/

UCHR b2bcd(UCHR x)
{
UCHR d1,d2;
	if(x > 99) x = 99;

	d1 = x / 10;
	d2 = x % 10;
	return d2 + (d1 << 4);
}

/****************************************************************************/

UCHR bcd2b(UCHR x)
{
	return (x & 0x0f) + ((x >> 4) & 0x0f) * 10;
}

/****************************************************************************/

